In [1]:
import pandas as pd

In [3]:
url = "https://data.cityofnewyork.us/api/views/25th-nujf/rows.csv"
df = pd.read_csv(url)
df

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,FEMALE,HISPANIC,GERALDINE,13,75
1,2011,FEMALE,HISPANIC,GIA,21,67
2,2011,FEMALE,HISPANIC,GIANNA,49,42
3,2011,FEMALE,HISPANIC,GISELLE,38,51
4,2011,FEMALE,HISPANIC,GRACE,36,53
...,...,...,...,...,...,...
57577,2014,MALE,WHITE NON HISPANIC,Yousef,18,94
57578,2014,MALE,WHITE NON HISPANIC,Youssef,24,88
57579,2014,MALE,WHITE NON HISPANIC,Yusuf,16,96
57580,2014,MALE,WHITE NON HISPANIC,Zachary,90,39
57581,2014,MALE,WHITE NON HISPANIC,Zev,49,65

## Export to CSV

In [4]:
df.to_csv("file_name.csv")

## Import excel with one sheet

In [5]:
pd.read_excel("Data - Multiple Worksheets.xlsx")
#By default excel imports only the first worksheet

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

## Import excel with several sheets

In [6]:
pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name = "Data 1")

  First Name Last Name           City Gender
0    Brandon     James          Miami      M
1       Sean   Hawkins         Denver      M
2       Judy       Day    Los Angeles      F
3     Ashley      Ruiz  San Francisco      F
4  Stephanie     Gomez       Portland      F

In [7]:
#Toi mport several worksheets:
pd.read_excel("Data - Multiple Worksheets.xlsx", sheet_name = ["Data 1", "Data 2"])

{'Data 1':   First Name Last Name           City Gender
 0    Brandon     James          Miami      M
 1       Sean   Hawkins         Denver      M
 2       Judy       Day    Los Angeles      F
 3     Ashley      Ruiz  San Francisco      F
 4  Stephanie     Gomez       Portland      F,
 'Data 2':   First Name Last Name           City Gender
 0     Parker     Power        Raleigh      F
 1    Preston  Prescott   Philadelphia      F
 2    Ronaldo   Donaldo         Bangor      M
 3      Megan   Stiller  San Francisco      M
 4     Bustin    Jieber         Austin      F}

## Export to excel with more than one sheets

In [9]:
females = baby_names[baby_names["Gender"]=="FEMALE"]
males = baby_names[baby_names["Gender"]=="MALE"]

In [10]:
with pd.ExcelWriter("file_name.xlsx") as excel_file: 
    females.to_excel(excel_file, sheet_name = "Females", index = False)
    males.to_excel(excel_file, sheet_name= "Males", index= False)